Revit 2026 API
AnalyticalToPhysicalAssociationManager.AddAssociation Method
Overload List
Name | Description
AddAssociation(ElementId, ElementId) |  Adds a new association between an analytical element and a physical element.
AddAssociation(ISet<ElementId>, ISet<ElementId>)
Top
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace